AUTO_config_TK_pesok/src/Catalogs/ПодтверждающиеДокументы/ПодтверждающиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодтверждающиеДокументы</name>
  <owners>Catalog.ТочкиДоставки</owners>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ТорговыеПлощадки</owners>
  <owners>Catalog.КассыККМ</owners>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <comment>Серия документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <comment>Номер документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <comment>Дата выдачи подтверждающего документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала действия подтверждающего документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания срока действия подтверждающего документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>Адрес</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <comment>Кем выдан подтверждающий документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБланка</name>
    <comment>Номер бланка подтверждающего документа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Enums/ВидыДокументов/ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументов</name>
  <comment>Виды подтверждающих документов</comment>
  <enumValues>
    <name>ЛицензияТабак</name>
  </enumValues>
  <enumValues>
    <name>ВыпискаИзРеестра</name>
    <comment>Выписка из Единого государственного реестра</comment>
  </enumValues>
  <enumValues>
    <name>ЛицензияАлкоголь</name>
  </enumValues>
  <enumValues>
    <name>ВыпискаИзКадастра</name>
    <comment>Выписка из Государственного земельного кадастра</comment>
  </enumValues>
  <enumValues>
    <name>ВыпискаПоНедвижимости</name>
    <comment>Выписка из реестра недвижимости</comment>
  </enumValues>
  <enumValues>
    <name>ДекларацияПБ</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/ПодтверждающиеДокументы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	Оформление();
КонецПроцедуры

&НаСервере
Процедура Оформление()
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.ТочкиДоставки") Тогда
		Элементы.Контрагент.Видимость = Истина;
		Контрагент = Объект.Владелец.Владелец;
	Иначе
		Элементы.Контрагент.Видимость = Ложь;
	КонецЕсли;
	
	МассивЭлементовВидимость = Новый Массив;
	
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаИзРеестра")
		ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаИзКадастра")
		ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаПоНедвижимости") Тогда
		МассивЭлементовВидимость.Добавить("ГруппаСерияНомер");
		МассивЭлементовВидимость.Добавить("ДатаНачала");
		МассивЭлементовВидимость.Добавить("ДатаОкончания");
		МассивЭлементовВидимость.Добавить("КемВыдан");
		МассивЭлементовВидимость.Добавить("Адрес");
		МассивЭлементовВидимость.Добавить("НомерБланка");
	КонецЕсли;
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияТабак")
		ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияАлкоголь") Тогда
		МассивЭлементовВидимость.Добавить("Серия");
		МассивЭлементовВидимость.Добавить("КемВыдан");
		МассивЭлементовВидимость.Добавить("Адрес");
		МассивЭлементовВидимость.Добавить("НомерБланка");
	КонецЕсли;
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ДекларацияПБ") Тогда
		МассивЭлементовВидимость.Добавить("Серия");
		МассивЭлементовВидимость.Добавить("ДатаНачала");
		МассивЭлементовВидимость.Добавить("ДатаОкончания");
		МассивЭлементовВидимость.Добавить("КемВыдан");
		МассивЭлементовВидимость.Добавить("Адрес");
		МассивЭлементовВидимость.Добавить("НомерБланка");
		Элементы.ГруппаСерияНомер.Видимость = Истина;
	КонецЕсли;
	ОбщегоНазначенияТККлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементовВидимость, "Видимость", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.ТочкиДоставки") Тогда
			Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияТабак");
		ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаИзРеестра");
		ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.КассыККМ") Тогда
			Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияАлкоголь");
		ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.ТорговыеПлощадки") Тогда
			Элементы.ВидыДокумента.ТолькоПросмотр = Ложь;
			Элементы.ВидыДокумента.РежимВыбораИзСписка = Истина;
			Элементы.ВидыДокумента.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаПоНедвижимости"));
			Элементы.ВидыДокумента.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВыпискаИзКадастра"));
			Элементы.ВидыДокумента.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.ДекларацияПБ"));
		КонецЕсли;
		Объект.Наименование = Объект.ВидДокумента;
	Иначе
		ДатаОкончанияПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПриИзменении(Элемент)
	Если Элемент.Имя = "Серия" Тогда
		Объект.Серия = ВРег(Объект.Серия);
	КонецЕсли;
	СформироватьНаименование();
	Оформление();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Выдача = "";
	Если ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
		Выдача = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'выдана %1'; uk = 'видана %1'"),
		Формат(Объект.ДатаВыдачи,"ДФ=dd.MM.yy"));
	КонецЕсли;
	Объект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = '%1%2%3%4'; uk = '%1%2%3%4'"),
	СокрЛП(Объект.ВидДокумента),
	?(ЗначениеЗаполнено(Объект.Серия)," "+СокрЛП(Объект.Серия),""),
	?(ЗначениеЗаполнено(Объект.Номер)," "+СокрЛП(Объект.Номер),""),
	?(ЗначениеЗаполнено(Выдача)," "+Выдача,Выдача));
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияТабак")
		ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументов.ЛицензияАлкоголь") Тогда
		Если КонецДня(Объект.ДатаОкончания) < ТекущаяДата() Тогда
			Элементы.ДатаОкончания.ЦветТекстаЗаголовка = WebЦвета.Малиновый;
			Элементы.ДатаОкончания.ЦветФона = WebЦвета.Розовый;
		Иначе
			Элементы.ДатаОкончания.ЦветТекстаЗаголовка = Новый Цвет;
			Элементы.ДатаОкончания.ЦветФона = Новый Цвет;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовШапкиФормы

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
	ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
	ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//СформироватьНаименование();
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти
